{
  "Compleanno": {
    "Simpatico": [
      "Buon compleanno, {name}! Ricorda: l'età è solo un numero… ma nel tuo caso è bello alto! 😂🎉",
      "Tantissimi auguri, {name}! Che la torta sia grande almeno quanto la tua voglia di festeggiare!",
      "Auguri, {name}! Un altro anno più saggio... o almeno più esperto nel nascondere le rughe! ",
      "Buon compleanno, {name}! Se la vita è una festa, tu sei il re/regina della pista da ballo! ",
      "Tanti auguri, {name}! Che i tuoi desideri siano tanti e le candeline poche... altrimenti serve un estintore! ",
      "Felice compleanno, {name}! Da oggi sei ufficialmente troppo vecchio per contare le candeline! ",
      "Auguri, {name}! Un anno in più di avventure... e di scuse per mangiare torta a colazione! ",
      "Buon compleanno, {name}! L'età è come il vino: migliora col tempo... o almeno così diciamo! ",
      "Tantissimi auguri, {name}! Che il tuo nuovo anno sia pieno di risate e zero diete fallite! ",
      "Felice compleanno, {name}! Ricorda: non invecchi, evolvi... in una versione premium di te stesso! "
    ],
    "Romantico": [
      "Buon compleanno, {name}. Ogni giorno con te è un dono, ma oggi lo è un po’ di più. ",
      "Auguri, {name}! Che questo giorno sia dolce come il tuo sorriso. ",
      "Felice compleanno, {name}. Il tuo amore illumina i miei giorni come stelle nel cielo notturno. ",
      "Tantissimi auguri, {name}! In te ho trovato il mio compleanno più bello, ogni singolo giorno. ",
      "Buon compleanno, {name}. Che i nostri cuori battano all'unisono per altri cento anni insieme. ",
      "Auguri, {name}! Sei il regalo più prezioso che la vita mi abbia mai donato. ",
      "Felice compleanno, {name}. Ogni tuo sorriso è una promessa di felicità eterna. ",
      "Tanti auguri, {name}! L'amore che proviamo cresce con te, anno dopo anno. ",
      "Buon compleanno, {name}. In questo giorno speciale, ti amo ancora di più, se possibile. ",
      "Auguri, {name}! Che la nostra storia continui a scrivere pagine di passione e tenerezza. "
    ],
    "Filosofico": [
      "Buon compleanno, {name}. La vita è un ciclo eterno: ogni fine è un nuovo inizio, e oggi ne celebriamo uno. ",
      "Auguri, {name}! Rifletti: l'età non misura il tempo, ma la profondità dell'anima che hai coltivato. ",
      "Felice compleanno, {name}. Nel flusso del tempo, ogni anno è un capitolo che ci insegna l'arte di esistere. ",
      "Tantissimi auguri, {name}! La vera saggezza nasce dall'accettare il cambiamento come alleato, non nemico. ",
      "Buon compleanno, {name}. Esistiamo per evolvere: che questo anno ti porti domande profonde e risposte serene. ",
      "Auguri, {name}! La filosofia della vita ci sussurra: celebra ogni momento, perché è irripetibile. ",
      "Felice compleanno, {name}. Nel grande disegno dell'universo, il tuo compleanno è una nota armonica unica. ",
      "Tanti auguri, {name}! Ricorda: l'essenza dell'essere umano è crescere attraverso le esperienze accumulate. ",
      "Buon compleanno, {name}. Ogni candelina spenta è un'illusione svanita, rivelando la luce interiore. ",
      "Auguri, {name}! La vita è un paradosso: più anni passano, più scopriamo la giovinezza dell'anima. "
    ],
    "Poetico": [
      "Buon compleanno, {name}. Che ogni anno sia una strofa del tuo poema più bello. ",
      "Auguri, {name}. Il tempo scorre, ma la tua luce resta sempre viva e sincera. ",
      "Felice compleanno, {name}. Come un fiore che sboccia, che il tuo spirito fiorisca eterno. ",
      "Tantissimi auguri, {name}! Nel cielo della vita, sei la stella che guida i miei versi. ",
      "Buon compleanno, {name}. Ogni rughetta è un verso inciso nel libro del tempo, prezioso e vero. ",
      "Auguri, {name}! Che i venti del destino portino petali di gioia al tuo giardino interiore. ",
      "Felice compleanno, {name}. La tua essenza danza come foglie d'autunno in un'eterna sinfonia. ",
      "Tanti auguri, {name}! Sei il verso mai finito di una poesia che il cuore recita all'alba. ",
      "Buon compleanno, {name}. Nel silenzio delle stelle, il tuo nome echeggia come un'ode immortale. ",
      "Auguri, {name}! Che questo giorno sia un haiku di serenità scritto dal destino per te. "
    ],
    "Giovane": [
      "Buon compleanno, {name}! Level up! Un altro anno di vibes epiche e zero filtri! ",
      "Auguri, {name}! Che il tuo feed sia full di stories lit e zero hangover da torta! ",
      "Felice B-day, {name}! Sei il GOAT, continua a slaying ogni goal come un boss! ",
      "Tantissimi auguri, {name}! Party mode on: shot di energia positiva per l'anno nuovo! ",
      "Buon compleanno, {name}! Swipe right su tutti i sogni, left sulle vibrazioni negative! ",
      "Auguri, {name}! Un anno in più di memes, squad goals e zero adulting stress! ",
      "Happy B-day, {name}! Che la tua playlist sia fire e i regali straight fire! ",
      "Tanti auguri, {name}! Glow up alert: questo anno spacchi tutto, no cap! ",
      "Buon compleanno, {name}! Netflix, chill e compleanni wild: la tua vita è uno story highlight! ",
      "Auguri, {name}! Yeet le candeline e catcha tutti i flex dell'anno che viene! "
    ],
    "Motivazionali": [
      "Buon compleanno, {name}! Questo nuovo anno è la tua tela bianca: dipingi sogni audaci e conquista ogni obiettivo con passione! ",
      "Auguri, {name}! Ricorda: ogni anno che passa è carburante per la tua grandezza. Corri verso i tuoi sogni senza fermarti! ",
      "Felice compleanno, {name}! Sei più forte di ieri, più saggio di prima. Usa questa forza per scalare montagne impossibili! ",
      "Tantissimi auguri, {name}! La vita ti regala un anno nuovo: afferra le opportunità e trasformale in vittorie epiche! ",
      "Buon compleanno, {name}! Non temere l'età: è il tuo alleato per brillare più forte. Inizia oggi la tua rivoluzione personale! ",
      "Auguri, {name}! Ogni candelina spenta è un passo verso l'eccellenza. Credi in te e il mondo si piegherà ai tuoi desideri! ",
      "Felice compleanno, {name}! Questo è il momento per rompere catene e volare alto. La tua storia di successo inizia ora! ",
      "Tanti auguri, {name}! Sii il capitano della tua nave: naviga con coraggio verso orizzonti di trionfi infiniti! ",
      "Buon compleanno, {name}! La resilienza è il tuo superpotere: usa ogni lezione del passato per dominare il futuro! ",
      "Auguri, {name}! Celebra te stesso: sei un'opera in divenire, pronta a ispirare il mondo con la tua luce interiore! "
    ]
  },
  "Anniversario": {
    "Romantico": [
      "Buon anniversario, {name}! Che il vostro amore continui a crescere e a illuminare ogni giorno.",
      "{name}, oggi si festeggia non solo un giorno, ma una storia fatta di sorrisi, abbracci e sogni condivisi.",
      "Auguri, {name}! Ogni momento con te è un'eternità di felicità che non vorrei mai terminare.",
      "Felice anniversario, {name}. Il tuo amore è il rifugio più dolce in cui il mio cuore ha trovato pace.",
      "Tantissimi auguri, {name}! Insieme, trasformiamo i giorni ordinari in avventure straordinarie.",
      "Buon anniversario, {name}. Che la nostra unione sia sempre un ponte verso orizzonti infiniti di amore.",
      "Auguri, {name}! Il tuo sguardo è la mia stella polare, guida costante nel cammino della vita.",
      "Felice anniversario, {name}. Ogni battito del nostro cuore è una sinfonia di passione condivisa.",
      "Tanti auguri, {name}! L'amore che ci lega è un tesoro che il tempo rende solo più prezioso.",
      "Buon anniversario, {name}. In te ho trovato non solo un compagno, ma l'anima gemella del mio cuore."
    ],
    "Simpatico": [
      "Auguri per l’anniversario, {name}! Un altro anno insieme… e ancora nessuno dei due è scappato!",
      "Buon anniversario, {name}! Che l’amore vinca sempre, anche contro il telecomando!",
      "Tantissimi auguri, {name}! Sopravvissuti a un altro giro sul carrozzone del matrimonio: complimenti!",
      "Felice anniversario, {name}! Da oggi, ufficiale: siete esperti nel dividere le bollette e i sogni!",
      "Auguri, {name}! Un anno in più di litigi finti e riappacificazioni epiche: la formula vincente!",
      "Buon anniversario, {name}! Che i vostri discorsi siano sempre più brevi e le risate più lunghe!",
      "Tanti auguri, {name}! Insieme da tanto: ormai sapete esattamente dove nascondere i segreti!",
      "Felice anniversario, {name}! Un altro capitolo: meno romanticismo, più pizza a letto!",
      "Auguri, {name}! Sopravvissuti alle serie TV in coppia: siete una squadra imbattibile!",
      "Buon anniversario, {name}! Che l’amore resista a tutto, tranne forse al tuo russare!"
    ],
    "Filosofico": [
      "Buon anniversario, {name}. L'amore è un viaggio nel tempo: ogni anno un passo verso la comprensione profonda dell'altro.",
      "Auguri, {name}! Riflettendo sul nostro cammino, capiamo che l'unione vera è l'arte di crescere insieme.",
      "Felice anniversario, {name}. Nel flusso dell'esistenza, il nostro legame è un ancoraggio contro le tempeste dell'anima.",
      "Tantissimi auguri, {name}! La filosofia dell'amore ci insegna: è nel condividere il silenzio che si parla di più.",
      "Buon anniversario, {name}. Ogni ciclo annuale è un invito a interrogarsi sul senso profondo della nostra connessione.",
      "Auguri, {name}! L'esistenza ci sussurra che l'amore autentico è un paradosso: eterno nel mutamento costante.",
      "Felice anniversario, {name}. Nel grande tappeto della vita, il nostro filo intrecciato è un disegno unico e necessario.",
      "Tanti auguri, {name}! La saggezza dell'anniversario: l'amore non conquista, ma si rivela nel tempo condiviso.",
      "Buon anniversario, {name}. Ogni anno è una meditazione sull'equilibrio tra indipendenza e fusione delle anime.",
      "Auguri, {name}! L'amore è la domanda filosofica più antica, e la nostra risposta è questa celebrazione."
    ],
    "Poetico": [
      "Buon anniversario, {name}. Come un fiume che incontra il mare, il nostro amore sfocia in un'eternità serena.",
      "Auguri, {name}! Ogni vostro sguardo è un verso inciso nel libro del tempo, indelebile e luminoso.",
      "Felice anniversario, {name}. Nel giardino del cuore, i vostri ricordi fioriscono come rose immortali.",
      "Tantissimi auguri, {name}! La vostra unione è un sonetto dove ogni strofa sussurra promesse silenziose.",
      "Buon anniversario, {name}. Come stelle intrecciate nel cielo notturno, illuminate il cammino l'uno dell'altra.",
      "Auguri, {name}! Il ritmo dei vostri passi è una melodia che l'universo compone in armonia perfetta.",
      "Felice anniversario, {name}. Ogni abbraccio è un'ode al mistero dell'amore, scritto con inchiostro di luce.",
      "Tanti auguri, {name}! Nel mosaico della vita, i vostri colori si fondono in un quadro di bellezza eterna.",
      "Buon anniversario, {name}. Come foglie d'autunno che danzano unite, celebrano il ciclo della passione.",
      "Auguri, {name}! La vostra storia è un'epica sussurrata dal vento, eco di cuori che battono all'unisono."
    ],
    "Giovane": [
      "Buon anniversario, {name}! Un altro level up nella nostra love story: next chapter incoming!",
      "Auguri, {name}! Insieme da tanto, ma ancora vibes fresh come il primo like su Insta!",
      "Felice anniv, {name}! Squad goals forever: noi contro il mondo, no cap!",
      "Tantissimi auguri, {name}! Che il nostro duo continui a slay ogni giorno, straight fire!",
      "Buon anniversario, {name}! Swipe right su altri mille anni di chaos e cuddle!",
      "Auguri, {name}! Un altro anno di memes condivisi e zero drama: we're winning!",
      "Felice anniv, {name}! La nostra playlist d'amore è lit, continua a drop those beats!",
      "Tanti auguri, {name}! Glow up di coppia: da crush a power couple, facts only!",
      "Buon anniversario, {name}! Netflix and chill level expert: upgrade unlocked!",
      "Auguri, {name}! Che il nostro feed sia full di stories epiche, forever and always!"
    ],
    "Motivazionali": [
      "Buon anniversario, {name}! Insieme siete una forza inarrestabile: continuate a crescere, a sfidare e a vincere ogni giorno! ",
      "Auguri, {name}! Questo traguardo vi ricorda: l'amore vero è il motore che vi spinge verso sogni più grandi, mano nella mano! ",
      "Felice anniversario, {name}! Siate l'ispirazione l'uno per l'altro: trasformate ogni sfida in un'opportunità di brillare! ",
      "Tantissimi auguri, {name}! Il vostro legame è resiliente: usatelo per scalare vette e realizzare visioni condivise! ",
      "Buon anniversario, {name}! Ogni anno insieme è carburante: accelerate verso un futuro di trionfi e passione infinita! ",
      "Auguri, {name}! Siete una squadra invincibile: credete nel vostro potere e conquistate il mondo con amore e determinazione! ",
      "Felice anniversario, {name}! Nutrite il vostro legame con azioni audaci: il domani è vostro da modellare! ",
      "Tanti auguri, {name}! L'unione vi rende più forti: affrontate l'ignoto con coraggio e trasformate sogni in realtà! ",
      "Buon anniversario, {name}! Siate il vento che spinge le vele dell'altro: navigate verso orizzonti di successo eterno! ",
      "Auguri, {name}! Questo giorno vi carica di energia: continuate a evolvere insieme, ispirando chi vi circonda! "
    ]
  },
  "Natale": {
    "Poetico": [
      "Buon Natale, {name}. Che la luce di questa festa illumini i tuoi sogni più belli.",
      "Auguri, {name}! Che ogni fiocco di neve porti con sé serenità e amore.",
      "Felice Natale, {name}. Nel manto argenteo della notte, il tuo cuore è la melodia più pura.",
      "Tantissimi auguri, {name}! L'albero addobbato sussurra versi di gioia eterna e pace profonda.",
      "Buon Natale, {name}. Come stelle cadenti, i tuoi desideri danzano in un cielo di promesse.",
      "Auguri, {name}! Il camino arde di fiamme poetiche, eco del calore che irradia la tua anima.",
      "Felice Natale, {name}. Ogni candela è un haiku di luce, dedicato alla bellezza del tuo spirito.",
      "Tanti auguri, {name}! Nel coro degli angeli, il tuo nome è il verso più dolce e armonioso.",
      "Buon Natale, {name}. La neve tesse un tappeto di silenzi, dove i sogni prendono forma in rime.",
      "Auguri, {name}! Questa festa è un sonetto di inverni passati, con te come musa immortale."
    ],
    "Simpatico": [
      "Buon Natale, {name}! Che il panettone sia soffice e i regali non ti deludano!",
      "Tanti auguri, {name}! Attento a non finire anche tu sotto l’albero dopo tutto quel cibo!",
      "Felice Natale, {name}! Un altro anno di renne ubriache e Babbi Natali con la pancia piena!",
      "Auguri, {name}! Che la tua calza sia piena di carbone solo se è per il barbecue!",
      "Buon Natale, {name}! Se la lista dei desideri è lunga, inizia con un po' di sonno post-pranzo!",
      "Tantissimi auguri, {name}! Natale: l'unica festa dove è ok fingere di non aver mangiato tre porzioni di lasagne!",
      "Felice Natale, {name}! Che i tuoi regali siano wrap-free e le calorie invisibili!",
      "Auguri, {name}! Sopravvivi al pranzo di famiglia: è la vera prova di resistenza natalizia!",
      "Buon Natale, {name}! Un brindisi per le canzoni stonate e le decorazioni storte: perfetto caos festivo!",
      "Tanti auguri, {name}! Che Babbo Natale ti porti tutto... tranne un altro maglione natalizio!"
    ],
    "Filosofico": [
      "Buon Natale, {name}. Questa festa ci invita a riflettere: nel dare, riceviamo il senso profondo dell'esistenza.",
      "Auguri, {name}! Il Natale è un ciclo eterno di luce e ombra, ricordandoci l'equilibrio della vita.",
      "Felice Natale, {name}. Nel silenzio della notte santa, scopriamo la saggezza dell'umiltà e della condivisione.",
      "Tantissimi auguri, {name}! La filosofia del Natale: l'amore universale è la chiave per trascendere il tempo.",
      "Buon Natale, {name}. Ogni dono è un atto di presenza, un ponte verso l'essenza dell'essere umano.",
      "Auguri, {name}! Riflettiamo: il vero miracolo natalizio è la capacità di rinnovare la speranza ogni anno.",
      "Felice Natale, {name}. Nel grande disegno cosmico, questa celebrazione è un inno alla connessione spirituale.",
      "Tanti auguri, {name}! Il Natale ci insegna che la gioia autentica nasce dalla semplicità condivisa.",
      "Buon Natale, {name}. Esistiamo per celebrare: ogni luce accesa è un invito a interrogarsi sul nostro cammino.",
      "Auguri, {name}! La profondità del Natale: un momento per contemplare l'unità nel diversity del mondo."
    ],
    "Romantico": [
      "Buon Natale, {name}. In questa notte magica, il tuo amore è la stella più luminosa del mio cielo.",
      "Auguri, {name}! Che il calore del camino sia solo un riflesso di quello che provi per te nel mio cuore.",
      "Felice Natale, {name}. Ogni fiocco di neve sussurra il tuo nome, rendendo questa festa eterna.",
      "Tantissimi auguri, {name}! Insieme, trasformiamo il Natale in un sogno condiviso di tenerezza infinita.",
      "Buon Natale, {name}. Il tuo bacio sotto il vischio è il regalo che desidero ogni giorno dell'anno.",
      "Auguri, {name}! L'amore che ci unisce è il vero spirito natalizio, luminoso e indimenticabile.",
      "Felice Natale, {name}. In te ho trovato il mio rifugio festivo, pieno di pace e passione.",
      "Tanti auguri, {name}! Che i nostri cuori battano al ritmo delle campanelle, per sempre uniti.",
      "Buon Natale, {name}. Questa festa è dolce solo perché la condivido con l'amore della mia vita.",
      "Auguri, {name}! Sotto le luci dell'albero, il nostro amore brilla più di mille candele accese."
    ],
    "Giovane": [
      "Buon Natale, {name}! Festive vibes on point: apri i regali e ignora le calorie!",
      "Auguri, {name}! Natale lit: playlist di jingle bells e squad sotto l'albero!",
      "Felice Xmas, {name}! Unwrap the chaos, level up la tua wishlist!",
      "Tantissimi auguri, {name}! Santa's dropping heat: che il tuo feed sia full di glow!",
      "Buon Natale, {name}! Chill mode activated: hot cocoa e zero adulting!",
      "Auguri, {name}! Merry and slay: questo Natale è tuo per il takeover!",
      "Felice Natale, {name}! Vibes only: renne, regali e stories epiche!",
      "Tanti auguri, {name}! Glow up natalizio: da elf a boss del party!",
      "Buon Natale, {name}! Flex su tutti i pacchetti, no cap, straight fire!",
      "Auguri, {name}! Natale remix: memes, marshmallows e mood forever young!"
    ],
    "Motivazionali": [
      "Buon Natale, {name}! Questa festa è il tuo reset: ricarica le energie e parti alla conquista di un anno di trionfi! ",
      "Auguri, {name}! Sotto le luci natalizie, ricorda: la speranza è il tuo alleato. Affronta il nuovo con audacia! ",
      "Felice Natale, {name}! Ogni dono è un seme: piantalo con determinazione e raccogli i frutti del successo! ",
      "Tantissimi auguri, {name}! Il Natale ti ispira: sii la luce che guida te stesso verso obiettivi luminosi! ",
      "Buon Natale, {name}! Lascia andare il vecchio: questo è il momento per rinascere più forte e ambizioso! ",
      "Auguri, {name}! La magia natalizia è dentro di te: usala per superare ostacoli e brillare intensamente! ",
      "Felice Natale, {name}! Condividi gioia e ricevi forza: il tuo cammino verso la grandezza inizia oggi! ",
      "Tanti auguri, {name}! Sii resiliente come l'inverno: fiorisci nella sfida e conquista il tuo destino! ",
      "Buon Natale, {name}! Ogni stella è un sogno: afferra il tuo e trasformalo in realtà con passione! ",
      "Auguri, {name}! Celebra la pace interiore: da qui, lancia te stesso verso vittorie epiche e durature! "
    ]
  },
  "Pasqua": {
    "Simpatico": [
      "Buona Pasqua, {name}! Che il tuo uovo contenga solo dolcezza e zero calorie! ",
      "Auguri, {name}! Che la tua giornata sia piena di sorrisi, cioccolato e serenità. ",
      "Felice Pasqua, {name}! Sopravvivi alla caccia alle uova: è l'Olimpiade delle famiglie!",
      "Tantissimi auguri, {name}! Che la colomba sia morbida e le calorie si evaporino magicamente!",
      "Buona Pasqua, {name}! Un altro anno di uova dipinte storte e risate garantite!",
      "Auguri, {name}! Pasqua: l'unica festa dove è ok nascondere il cioccolato dai parenti!",
      "Felice Pasqua, {name}! Che i tuoi coniglietti siano solo di cioccolato, non reali!",
      "Tanti auguri, {name}! Buon appetito: la Pasqua è la scusa perfetta per il terzo uovo!",
      "Buona Pasqua, {name}! Se vedi un uovo d'oro, tienilo: è il tuo bonus pasquale!",
      "Auguri, {name}! Che la tua Pasqua sia epica, con zero coniglietti in fuga!"
    ],
    "Poetico": [
      "Buona Pasqua, {name}. Che la rinascita e la luce ti accompagnino in ogni nuovo inizio. ",
      "Auguri, {name}! Nel giardino della primavera, i tuoi sogni fioriscono come versi immortali.",
      "Felice Pasqua, {name}. Ogni raggio di sole è un'ode alla resurrezione del tuo spirito sereno.",
      "Tantissimi auguri, {name}! La Pasqua tesse un arazzo di petali, dove il tuo cuore è il filo d'oro.",
      "Buona Pasqua, {name}. Come un uovo che si schiude, la tua anima danza in armonia con la luce eterna.",
      "Auguri, {name}! Il vento primaverile sussurra poesie di speranza, dedicate alla tua essenza luminosa.",
      "Felice Pasqua, {name}. Nel coro degli uccelli, il tuo nome è il refrain più dolce e melodioso.",
      "Tanti auguri, {name}! Questa festa è un sonetto di colori, con te come musa della rinascita.",
      "Buona Pasqua, {name}. Le stelle della notte pasquale scrivono elegie per la bellezza del tuo cammino.",
      "Auguri, {name}! Ogni fiore è un haiku di gioia, sbocciato dal seme del tuo cuore indomito."
    ],
    "Romantico": [
      "Buona Pasqua, {name}. In questa festa di rinascita, il mio amore per te fiorisce come un giardino primaverile. ",
      "Auguri, {name}! Che il tuo cuore sia pieno di dolcezza, come il cioccolato che condividiamo sotto il sole pasquale. ",
      "Felice Pasqua, {name}. Ogni tuo sorriso è la luce che rende questa festa un'eterna primavera d'amore.",
      "Tantissimi auguri, {name}! Insieme, celebriamo la rinascita del nostro legame, tenero e indistruttibile.",
      "Buona Pasqua, {name}. Il tuo abbraccio è il nido più dolce in cui il mio cuore pasquale riposa.",
      "Auguri, {name}! Che i nostri sogni sboccino come fiori, in questa giornata di passione condivisa.",
      "Felice Pasqua, {name}. L'amore che proviamo è la vera resurrezione, che ci unisce ogni primavera.",
      "Tanti auguri, {name}! Sotto il cielo azzurro, il tuo nome è la melodia più romantica della Pasqua.",
      "Buona Pasqua, {name}. Ogni uovo è un simbolo del nostro amore: fragile fuori, prezioso dentro.",
      "Auguri, {name}! Che questa festa ci ricordi quanto siamo perfetti l'uno per l'altra, per sempre."
    ],
    "Filosofico": [
      "Buona Pasqua, {name}. Questa celebrazione ci invita a riflettere sulla rinascita: ogni fine è un'opportunità di trasformazione profonda.",
      "Auguri, {name}! La Pasqua è un ciclo eterno di luce e ombra, insegnandoci l'equilibrio tra sacrificio e gioia.",
      "Felice Pasqua, {name}. Nel silenzio della resurrezione, scopriamo la saggezza dell'accettare il cambiamento come alleato.",
      "Tantissimi auguri, {name}! La filosofia pasquale: la vera libertà nasce dal liberare l'anima dalle catene del passato.",
      "Buona Pasqua, {name}. Ogni uovo spezzato è metafora della vita: dal guscio emerge la forza interiore.",
      "Auguri, {name}! Riflettiamo: la Pasqua ci sussurra che l'esistenza è un'eterna primavera di possibilità.",
      "Felice Pasqua, {name}. Nel grande flusso cosmico, questa festa è un inno alla continuità dello spirito umano.",
      "Tanti auguri, {name}! La profondità della Pasqua: comprendere che la luce vince sempre l'oscurità.",
      "Buona Pasqua, {name}. Esistiamo per rinascere: ogni anno un invito a interrogarsi sul nostro cammino interiore.",
      "Auguri, {name}! L'amore e la resurrezione sono domande filosofiche: la nostra risposta è questa celebrazione condivisa."
    ],
    "Giovane": [
      "Buona Pasqua, {name}! Egg hunt level up: caccia al cioccolato e zero regrets! ",
      "Auguri, {name}! Pasqua vibes: sweet come la colomba, lit come il tuo feed!",
      "Felice Easter, {name}! Unwrap the fun, drop the drama, slay the brunch!",
      "Tantissimi auguri, {name}! Bunny mode on: hop to the next adventure, no cap!",
      "Buona Pasqua, {name}! Chocolate overload alert: flex those gains pasquali!",
      "Auguri, {name}! Spring break energy: uova, amici e stories infinite!",
      "Felice Pasqua, {name}! Glow up season: da uovo a boss in un battito!",
      "Tanti auguri, {name}! Pasqua remix: memes, marshmallows e mood forever fresh!",
      "Buona Pasqua, {name}! Squad goals: coniglietti, confetti e chaos epico!",
      "Auguri, {name}! Easter slay: il tuo outfit pasquale è straight fire!"
    ],
    "Motivazionali": [
      "Buona Pasqua, {name}! Questa rinascita è il tuo segnale: esci dal guscio e conquista il mondo con nuova energia! ",
      "Auguri, {name}! La Pasqua ti insegna: dalle ceneri sorgi più forte. Affronta le sfide con passione primaverile! ",
      "Felice Pasqua, {name}! Ogni uovo è un'opportunità: rompi i limiti e fai sbocciare i tuoi talenti! ",
      "Tantissimi auguri, {name}! Sii resiliente come la resurrezione: trasforma ostacoli in trampolini verso il successo! ",
      "Buona Pasqua, {name}! La primavera del cuore inizia ora: pianta semi di ambizione e raccogli vittorie! ",
      "Auguri, {name}! Celebra la luce interiore: usala per illuminare il cammino verso sogni audaci e realizzati! ",
      "Felice Pasqua, {name}! Rinascita significa azione: corri verso i tuoi obiettivi con gioia e determinazione! ",
      "Tanti auguri, {name}! La Pasqua è il tuo boost: sii il fiore che sfida il vento e fiorisce eterno! ",
      "Buona Pasqua, {name}! Da oggi, credi nel tuo potere di rinnovarti: il futuro è tuo da forgiare! ",
      "Auguri, {name}! Questa festa motiva: afferra la dolcezza della vita e trasformala in energia per trionfare! "
    ]
  },
  "San Valentino": {
    "Romantico": [
      "Buon San Valentino, {name}. Ogni battito del mio cuore oggi è solo per te. ",
      "Auguri, {name}! L’amore è fatto di piccoli gesti, e questo messaggio è uno di quelli. ",
      "Felice San Valentino, {name}. In te ho trovato il mio rifugio eterno, dove il tempo si ferma tra le tue braccia.",
      "Tantissimi auguri, {name}! Il tuo sorriso è la luce che illumina ogni mio San Valentino futuro.",
      "Buon San Valentino, {name}. Che il nostro amore sia come una rosa: eterno e profumato di passione.",
      "Auguri, {name}! Ogni tuo bacio è un'eternità che desidero rivivere all'infinito.",
      "Felice San Valentino, {name}. Sotto questo cielo di cuori, il mio amore per te è la stella più brillante.",
      "Tanti auguri, {name}! Insieme, rendiamo ogni giorno un San Valentino di tenerezza infinita.",
      "Buon San Valentino, {name}. Il tuo cuore batte nel mio, in una sinfonia di emozioni condivise.",
      "Auguri, {name}! Oggi celebro non solo te, ma l'avventura meravigliosa che è amarti."
    ],
    "Poetico": [
      "Buon San Valentino, {name}. L’amore è il verso più dolce scritto nel libro della vita. ",
      "Auguri, {name}! Che questo giorno ti ricordi quanto sei speciale per chi ti ama. ",
      "Felice San Valentino, {name}. Come un petalo di rosa nel vento, il tuo amore danza eterno nel mio cuore.",
      "Tantissimi auguri, {name}! Nel cielo di cuori rossi, sei la costellazione che guida i miei sogni.",
      "Buon San Valentino, {name}. Ogni tuo sussurro è un sonetto inciso nelle pagine del nostro destino.",
      "Auguri, {name}! Il ritmo del tuo cuore è la melodia che ispira le mie poesie più intime.",
      "Felice San Valentino, {name}. Sotto il manto della notte, il nostro amore brilla come stelle intrecciate.",
      "Tanti auguri, {name}! Sei la musa di un'epica d'amore, dove ogni capitolo è un bacio rubato.",
      "Buon San Valentino, {name}. Come fiumi che si uniscono al mare, i nostri cuori sfociano in un'eternità serena.",
      "Auguri, {name}! Questa festa è un haiku di passione, con te come l'ultimo verso immortale."
    ],
    "Simpatico": [
      "Buon San Valentino, {name}! L'amore è come il cioccolato: dolce, irresistibile e con qualche caloria extra! ",
      "Auguri, {name}! Oggi è San Valentino: se non sai cosa regalare, un abbraccio funziona sempre... e costa zero! ",
      "Felice San Valentino, {name}! Che la tua giornata sia piena di cuori e zero frecce di Cupido dolorose!",
      "Tantissimi auguri, {name}! San Valentino: la festa dove fingiamo di essere romantici per un giorno solo! ",
      "Buon San Valentino, {name}! Se l'amore è cieco, spero che non inciampi sul mio regalo! ",
      "Auguri, {name}! Oggi festeggiamo l'amore... o almeno la scusa per mangiare più cioccolato!",
      "Felice San Valentino, {name}! Che Cupido ti colpisca dritto al cuore... e non al portafoglio! ",
      "Tanti auguri, {name}! San Valentino: dove i single fingono di stare bene e le coppie discutono sul cena!",
      "Buon San Valentino, {name}! L'amore vero è quello che sopravvive a una cena italiana con la suocera! ",
      "Auguri, {name}! Oggi è il giorno per dire 'ti amo'... o almeno 'passami il telecomando'! "
    ],
    "Filosofico": [
      "Buon San Valentino, {name}. L'amore è il mistero più profondo: un ponte tra anime che sfida il tempo e lo spazio.",
      "Auguri, {name}! Riflettendo sull'amore, capiamo che è l'essenza stessa dell'esistenza, un paradosso di libertà e legame.",
      "Felice San Valentino, {name}. Nel flusso della vita, il nostro amore è un ancoraggio eterno contro le tempeste dell'anima.",
      "Tantissimi auguri, {name}! La filosofia dell'amore ci insegna: è nel dare senza aspettativa che riceviamo l'infinito.",
      "Buon San Valentino, {name}. Ogni cuore è un universo: il nostro si intreccia in una cosmica armonia di destini.",
      "Auguri, {name}! L'esistenza ci sussurra che l'amore autentico è un viaggio verso la saggezza condivisa.",
      "Felice San Valentino, {name}. Nel grande disegno del mondo, il nostro legame è un filo necessario per il tappeto della vita.",
      "Tanti auguri, {name}! San Valentino ci invita a interrogarsi: l'amore conquista o semplicemente rivela?",
      "Buon San Valentino, {name}. Ogni emozione è una meditazione: la nostra è sull'equilibrio tra passione e serenità.",
      "Auguri, {name}! L'amore è la domanda eterna: la nostra celebrazione è la risposta più pura e profonda."
    ],
    "Giovane": [
      "Buon San Valentino, {name}! Love alert: il tuo vibe è straight fire, no cap! ",
      "Auguri, {name}! San Val vibes: swipe right su di te ogni giorno, forever! ",
      "Felice V-Day, {name}! Squad couple goals: noi slayiamo l'amore come boss!",
      "Tantissimi auguri, {name}! Cupido dropping arrows lit: catch this L-O-V-E!",
      "Buon San Valentino, {name}! Chill con chocolate e cuddle: mood unlocked! ",
      "Auguri, {name}! Heart eyes emoji per te: il tuo glow è next level!",
      "Felice San Val, {name}! Playlist d'amore on repeat: tracks only for us!",
      "Tanti auguri, {name}! Flex su questo giorno: da crush a endgame, facts!",
      "Buon San Valentino, {name}! Netflix, roses e zero drama: winning combo!",
      "Auguri, {name}! V-Day remix: memes romantici e stories epiche insieme!"
    ],
    "Motivazionali": [
      "Buon San Valentino, {name}! L'amore è la tua forza suprema: usalo per spingerti oltre i limiti e realizzare sogni epici! ",
      "Auguri, {name}! In questo giorno di cuori, ricorda: la passione ti rende invincibile. Conquista con tenerezza e coraggio! ",
      "Felice San Valentino, {name}! Sii l'ispirazione per te stesso: l'amore inizia dal credere nel tuo potenziale infinito! ",
      "Tantissimi auguri, {name}! Ogni battito è un passo: usa l'energia dell'amore per scalare vette di successo personale! ",
      "Buon San Valentino, {name}! L'amore ti carica: affronta le sfide con il cuore aperto e trasformale in vittorie! ",
      "Auguri, {name}! Celebra la connessione: sii resiliente e audace, il mondo è pronto per la tua luce romantica! ",
      "Felice San Valentino, {name}! Questo è il tuo boost emotivo: parti alla volta di obiettivi con passione rinnovata! ",
      "Tanti auguri, {name}! L'amore è il vento nelle vele: naviga con determinazione verso un futuro luminoso! ",
      "Buon San Valentino, {name}! Nutri il tuo spirito: da oggi, ogni gesto d'amore ti spinge verso la grandezza! ",
      "Auguri, {name}! San Valentino motiva: afferra la dolcezza e trasformala in carburante per trionfi duraturi! "
    ]
  },
  "Laurea": {
    "Simpatico": [
      "Complimenti, {name}! Finalmente dottore… o dottoressa! Ora puoi lamentarti con più competenza! ",
      "Auguri, {name}! Hai vinto la battaglia contro gli esami. Ora inizia la guerra del lavoro! ",
      "Felici congratulazioni, {name}! Laureato: da oggi il tuo superpotere è dire 'ho una laurea' a ogni colloquio!",
      "Tantissimi auguri, {name}! La laurea è come un trofeo: luccicante, ma non ti fa il caffè da solo!",
      "Complimenti, {name}! Sopravvissuto a notti in bianco e caffè amari: sei un eroe da fumetto! ",
      "Auguri, {name}! Ora che sei laureato, le uniche scadenze sono quelle del mutuo... benvenuto nel club adulto!",
      "Felice laurea, {name}! Hai studiato tanto per questo: tempo di festeggiare con zero sensi di colpa!",
      "Tanti complimenti, {name}! La toga ti sta d'incanto... ma levatela prima della festa, eh!",
      "Congratulazioni, {name}! Un passo in più verso il mondo: attento a non inciampare nei contratti!",
      "Auguri, {name}! Laurea conquistata: ora puoi ignorare gli zii che ti chiedevano 'e il lavoro?' con autorevolezza!"
    ],
    "Motivazionale": [
      "Congratulazioni, {name}! Questo traguardo è solo l’inizio di un viaggio pieno di successi.",
      "Bravissimo/a, {name}! La laurea è la prova che i sogni, con impegno, diventano realtà."
    ],
    "Romantico": [
      "Congratulazioni, {name}! Questa laurea è il fiore più bello del giardino dei nostri sogni condivisi. ",
      "Auguri, {name}! Il tuo successo illumina il mio cuore come una stella nel cielo della nostra storia d'amore.",
      "Felice laurea, {name}. Ogni tuo traguardo è un bacio che il destino ci regala, pieno di passione e orgoglio.",
      "Tantissimi complimenti, {name}! In te vedo non solo un laureato, ma l'amore della mia vita che conquista il mondo.",
      "Congratulazioni, {name}. Che questa nuova pagina sia scritta con l'inchiostro del nostro amore eterno.",
      "Auguri, {name}! Il tuo sorriso da laureato è il regalo più dolce che potessi desiderare oggi.",
      "Felice laurea, {name}. Insieme, celebriamo questo momento come l'inizio di avventure intrecciate nei cuori.",
      "Tanti auguri, {name}! La tua dedizione mi ha insegnato che l'amore vero supporta ogni volo verso il successo.",
      "Congratulazioni, {name}. Ogni esame superato è un verso d'amore dedicato alla forza del nostro legame.",
      "Auguri, {name}! Questa laurea sigilla il patto del nostro domani, luminoso e colmo di tenerezza."
    ],
    "Filosofico": [
      "Congratulazioni, {name}. La laurea non è fine, ma inizio: un invito a interrogarsi sul senso del sapere nel flusso della vita.",
      "Auguri, {name}! Riflettendo su questo traguardo, capiamo che la conoscenza è un ponte verso l'essenza dell'esistenza umana.",
      "Felice laurea, {name}. Nel ciclo eterno di apprendimento, ogni diploma è un passo verso la saggezza interiore.",
      "Tantissimi complimenti, {name}! La filosofia ci insegna: il vero studio è quello che nutre l'anima oltre i libri.",
      "Congratulazioni, {name}. Questo momento è un paradosso: chiusura di un'era, apertura a domande infinite sul nostro cammino.",
      "Auguri, {name}! L'esistenza sussurra che il sapere autentico è umile, un dialogo costante con il mondo e se stessi.",
      "Felice laurea, {name}. Nel grande disegno cosmico, il tuo percorso è un filo che tesse il tappeto della scoperta.",
      "Tanti auguri, {name}! La laurea invita a meditare: quanto del nostro apprendimento è eco del desiderio di trascendere?",
      "Congratulazioni, {name}. Ogni conoscenza acquisita è una meditazione sull'equilibrio tra mente e spirito.",
      "Auguri, {name}! Questo traguardo filosofico: celebrare non il possesso del sapere, ma la gioia di averlo cercato."
    ],
    "Poetico": [
      "Congratulazioni, {name}. La laurea è un verso inciso nel libro del tempo, luminoso e indimenticabile. ",
      "Auguri, {name}! Come un'aquila che spicca il volo, il tuo spirito si libra verso orizzonti di poesia infinita.",
      "Felice laurea, {name}. Ogni pagina studiata è un petalo nel bouquet della tua anima fiorita.",
      "Tantissimi complimenti, {name}! Nel cielo della conoscenza, sei la stella che guida i sogni dei poeti.",
      "Congratulazioni, {name}. Questa toga è un mantello di versi, dove il tuo nome echeggia eterno.",
      "Auguri, {name}! Il ritmo dei tuoi passi da laureato è una sinfonia composta dal destino.",
      "Felice laurea, {name}. Come un fiume che raggiunge il mare, il tuo sapere sfocia in un'ode di pace.",
      "Tanti auguri, {name}! Sei la musa di un'epica accademica, con capitoli di luce e armonia.",
      "Congratulazioni, {name}. Ogni esame è un haiku di perseveranza, dedicato alla bellezza del tuo cammino.",
      "Auguri, {name}! La laurea tesse un arazzo di stelle, dove il tuo futuro brilla in rime silenziose."
    ],
    "Giovane": [
      "Congratulazioni, {name}! Laurea unlocked: level up totale, ora slay il mondo reale! ",
      "Auguri, {name}! Da studente a boss: il tuo feed è lit con quel cappello da dottore!",
      "Felice laurea, {name}! Squad, we've made it: party mode on, no more all-nighters!",
      "Tantissimi complimenti, {name}! Glow up accademico: da cramming a crushing goals!",
      "Congratulazioni, {name}! Diploma in mano: swipe right su carriere epiche, left su dubbi!",
      "Auguri, {name}! Laureato vibes: memes di vittoria e zero rimpianti per le notti in bianco!",
      "Felice laurea, {name}! Straight fire achievement: ora flexa quel CV come un pro!",
      "Tanti auguri, {name}! Da campus chaos a adulting win: you're the GOAT!",
      "Congratulazioni, {name}! Laurea alert: playlist di hype e stories di festa infinite!",
      "Auguri, {name}! Boss level reached: che il prossimo chapter sia full di wins e zero stress!"
    ],
    "Motivazionali": [
      "Congratulazioni, {name}! Questa laurea è il tuo lancio: vola alto, conquista sogni e non fermarti mai! ",
      "Auguri, {name}! Hai dimostrato che l'impegno vince: usa questa forza per dominare il tuo futuro luminoso! ",
      "Felice laurea, {name}! Ogni sforzo ti ha reso invincibile: parti ora alla volta di traguardi epici! ",
      "Tantissimi complimenti, {name}! Sei la prova vivente: i sogni si realizzano con passione. Continua a brillare! ",
      "Congratulazioni, {name}! Il diploma è solo l'inizio: sii audace, resiliente e trasforma il mondo! ",
      "Auguri, {name}! Celebra la tua tenacia: da oggi, ogni passo è verso la grandezza che meriti! ",
      "Felice laurea, {name}! Nutri la tua ambizione: il successo è tuo, afferralo con mani ferme! ",
      "Tanti auguri, {name}! La conoscenza è il tuo superpotere: usala per ispirare e trionfare ovunque! ",
      "Congratulazioni, {name}! Rinascita accademica: corri verso orizzonti di vittorie infinite e audaci! ",
      "Auguri, {name}! Questo traguardo motiva: credi in te e il mondo si aprirà ai tuoi talenti! "
    ]
  },
  "Onomastico": {
    "Simpatico": [
      "Buon onomastico, {name}! Ti meriti un brindisi solo per avere un nome così bello! ",
      "Tantissimi auguri, {name}! Che il tuo nome risuoni oggi in ogni sorriso e abbraccio. ",
      "Felice onomastico, {name}! Un nome unico come te: facile da ricordare, difficile da dimenticare! ",
      "Auguri, {name}! Oggi festeggiamo il tuo nome: è l'unica cosa che non ti fa mai arrabbiare! ",
      "Buon onomastico, {name}! Che il tuo nome sia sempre pronunciato con gioia... e zero storpiature! ",
      "Tanti auguri, {name}! Il tuo nome è come un superpotere: apre porte e fa ridere tutti! ",
      "Felice onomastico, {name}! Un giorno solo per te e il tuo nome: zero compiti, full party! ",
      "Auguri, {name}! Che il tuo nome oggi sia trending: tutti lo dicono, nessuno lo sbaglia! ",
      "Buon onomastico, {name}! Nome top: facile da scrivere, impossibile da cancellare dai cuori! ",
      "Tantissimi auguri, {name}! Festeggia il tuo nome come un VIP: brindisi e zero paparazzi!"
    ],
    "Poetico": [
      "Buon onomastico, {name}. Che il tuo nome porti sempre luce e significato ai giorni che verranno. ",
      "Auguri, {name}! Nel vento del tempo, il tuo nome è un verso che danza eterno nei cieli della poesia.",
      "Felice onomastico, {name}. Ogni sillaba è un petalo nel giardino dei sogni, profumato di mistero.",
      "Tantissimi auguri, {name}! Il tuo nome echeggia come un'ode antica, sussurrata dalle stelle silenziose.",
      "Buon onomastico, {name}. Come un fiume di inchiostro, scorre nei libri del destino con grazia infinita.",
      "Auguri, {name}! Sei la musa di un sonetto invisibile, dove il tuo nome è il refrain più melodioso.",
      "Felice onomastico, {name}. Nel manto della notte, il tuo nome brilla come costellazione d'argento.",
      "Tanti auguri, {name}! Ogni lettera è un haiku di essenza, dedicato alla bellezza del tuo spirito.",
      "Buon onomastico, {name}. Il tuo nome tesse un arazzo di rime, dove il cuore recita inni d'amore.",
      "Auguri, {name}! Questa festa è un'epica sussurrata, con te come eroe di versi immortali."
    ],
    "Romantico": [
      "Buon onomastico, {name}. Il tuo nome è la melodia più dolce che il mio cuore sussurra ogni giorno. ",
      "Auguri, {name}! Ogni lettera del tuo nome è un bacio che custodisco nel profondo dell'anima. ",
      "Felice onomastico, {name}. In te, il tuo nome non è solo un suono, ma l'essenza del mio amore eterno.",
      "Tantissimi auguri, {name}! Il tuo nome è il rifugio dove il mio cuore trova pace e passione infinita.",
      "Buon onomastico, {name}. Che ogni sillaba porti con sé il calore del nostro amore condiviso.",
      "Auguri, {name}! Pronuncio il tuo nome come una preghiera, piena di tenerezza e desiderio.",
      "Felice onomastico, {name}. Il tuo nome è la stella che illumina i miei sogni più romantici.",
      "Tanti auguri, {name}! In questo giorno, celebro non solo te, ma il suono che mi fa battere il cuore.",
      "Buon onomastico, {name}. Ogni tuo nome è un verso d'amore scritto nel libro della nostra storia.",
      "Auguri, {name}! Che il tuo nome echeggi nei miei pensieri come una sinfonia di affetto puro."
    ],
    "Filosofico": [
      "Buon onomastico, {name}. Il nome è il primo specchio dell'anima: rifletti su ciò che esso rivela del tuo cammino.",
      "Auguri, {name}! Nel flusso dell'esistenza, il tuo nome è un'ancora che lega l'individuo all'universo condiviso.",
      "Felice onomastico, {name}. Ogni nome è una domanda filosofica: chi siamo nel grande disegno del tempo?",
      "Tantissimi auguri, {name}! La saggezza del nome: un'eredità che ci invita a interrogarsi sull'identità profonda.",
      "Buon onomastico, {name}. Esistiamo attraverso i nomi: simboli di continuità nel ciclo eterno della vita.",
      "Auguri, {name}! Riflettendo sul tuo nome, scopriamo il paradosso dell'unicità nel tessuto collettivo dell'umanità.",
      "Felice onomastico, {name}. Il nome è un ponte tra passato e futuro, un invito alla meditazione sull'essere.",
      "Tanti auguri, {name}! La filosofia ci sussurra: nel nome risiede il seme della nostra essenza immortale.",
      "Buon onomastico, {name}. Ogni pronuncia è un atto di presenza, un dialogo silenzioso con l'infinito.",
      "Auguri, {name}! Questo giorno celebra il nome come chiave per sbloccare i misteri dell'anima umana."
    ],
    "Giovane": [
      "Buon onomastico, {name}! Nome lit: level up il tuo vibe, straight fire today! ",
      "Auguri, {name}! Il tuo nome è trending: swipe right su questa festa epica!",
      "Felice onomastico, {name}! Squad, celebrate: il tuo handle è the GOAT!",
      "Tantissimi auguri, {name}! Name day glow up: memes, music e zero chill needed!",
      "Buon onomastico, {name}! Flex quel nome come un boss: stories full di hype!",
      "Auguri, {name}! Onomastico vibes: playlist on, party mode activated!",
      "Felice onomastico, {name}! Da username a legend: you're slaying this day!",
      "Tanti auguri, {name}! Name alert: drop the confetti, catch the wins!",
      "Buon onomastico, {name}! Remix del tuo nome: fresh, fun e forever young!",
      "Auguri, {name}! Onomastico takeover: il tuo nome è the next big thing!"
    ],
    "Motivazionali": [
      "Buon onomastico, {name}! Il tuo nome è il tuo marchio: portalo con orgoglio e conquista il mondo con la tua unicità! ",
      "Auguri, {name}! Ogni sillaba è un potere: usala per affermare la tua forza e realizzare visioni audaci! ",
      "Felice onomastico, {name}! Sii l'eco del tuo nome: riecheggia con determinazione e ispiri chi ti circonda! ",
      "Tantissimi auguri, {name}! Il tuo nome motiva: trasformalo in un inno di resilienza e successi infiniti! ",
      "Buon onomastico, {name}! Celebra la tua essenza: da oggi, pronuncia il tuo nome con la voce di un campione! ",
      "Auguri, {name}! Il nome è il tuo alleato: con esso, sfida i dubbi e vola verso traguardi epici! ",
      "Felice onomastico, {name}! Nutri la tua identità: sii audace e trasforma ogni giorno in una vittoria! ",
      "Tanti auguri, {name}! Il tuo nome è seme di grandezza: piantalo con passione e raccogli frutti eterni! ",
      "Buon onomastico, {name}! Afferma te stesso: il mondo attende la tua storia, scrivila con coraggio! ",
      "Auguri, {name}! Questo giorno ti carica: porta il tuo nome come una corona e regna sulla tua vita! "
    ]
  },
  "Matrimonio": {
    "Romantico": [
      "Auguri, {name}! Che questo giorno sia l’inizio di un amore eterno e pieno di gioia. ",
      "Buon matrimonio, {name}! Che la vostra unione sia forte come un abbraccio e dolce come un bacio. ",
      "Congratulazioni, {name}. In te ho trovato il mio per sempre, un sogno che si avvera tra le tue braccia.",
      "Tantissimi auguri, {name}! Il vostro amore è la melodia che il destino ha composto per i nostri cuori.",
      "Felice matrimonio, {name}. Ogni tuo 'sì' è un voto eterno che illumina il cammino della nostra vita insieme.",
      "Auguri, {name}! Che la vostra storia sia un giardino di rose, profumato di passione infinita.",
      "Congratulazioni, {name}. Sotto questo velo di felicità, il mio cuore batte solo per te, per sempre.",
      "Tanti auguri, {name}! L'amore che ci unisce è il sole che scalda ogni alba della nostra unione.",
      "Buon matrimonio, {name}. Insieme, trasformiamo i giorni in poesie d'amore scritte con sguardi complici.",
      "Auguri, {name}! Questo giorno sigilla non solo un patto, ma l'eternità del nostro amore condiviso."
    ],
    "Poetico": [
      "Congratulazioni, {name}. Come due fiumi che si uniscono al mare, il vostro amore sfocia in un'eternità serena. ",
      "Auguri, {name}! Ogni vostro voto è un verso inciso nel libro del tempo, luminoso e indelebile.",
      "Felice matrimonio, {name}. Nel giardino del destino, i vostri cuori fioriscono come rose immortali.",
      "Tantissimi auguri, {name}! La vostra unione è un sonetto dove ogni strofa sussurra promesse silenziose.",
      "Buon matrimonio, {name}. Come stelle intrecciate nel cielo notturno, illuminate il cammino l'uno dell'altra.",
      "Auguri, {name}! Il ritmo dei vostri passi è una melodia che l'universo compone in armonia perfetta.",
      "Congratulazioni, {name}. Ogni abbraccio è un'ode al mistero dell'amore, scritto con inchiostro di luce.",
      "Tanti auguri, {name}! Nel mosaico della vita, i vostri colori si fondono in un quadro di bellezza eterna.",
      "Felice matrimonio, {name}. Come foglie d'autunno che danzano unite, celebrano il ciclo della passione.",
      "Auguri, {name}! La vostra storia è un'epica sussurrata dal vento, eco di cuori che battono all'unisono."
    ],
    "Simpatico": [
      "Congratulazioni, {name}! Da oggi il 'per sempre' inizia davvero… buona fortuna! ",
      "Auguri, {name}! Che la vostra vita insieme sia piena di risate, amore e pizza condivisa! ",
      "Felice matrimonio, {name}! Sopravvissuti alla cerimonia: ora la vera avventura con i suoceri!",
      "Tantissimi auguri, {name}! Matrimonio: dove 'sì' significa anche 'sì al lavare i piatti'!",
      "Congratulazioni, {name}! Unione perfetta: lui cucina, lei pulisce... o viceversa, buona fortuna!",
      "Auguri, {name}! Che il vostro nido d'amore sia comodo e con Wi-Fi forte per le liti!",
      "Felice matrimonio, {name}! Da single a coppia: addio weekend pigri, benvenuti i compromessi epici!",
      "Tanti auguri, {name}! Il matrimonio è come un film: speriamo sia commedia, non horror!",
      "Congratulazioni, {name}! Ora siete una squadra: dividete i sogni e le bollette alla pari!",
      "Auguri, {name}! Che la vostra luna di miele sia dolce... e il ritorno alla realtà non troppo amaro!"
    ],
    "Filosofico": [
      "Congratulazioni, {name}. Il matrimonio è un viaggio nel tempo: ogni passo un invito a crescere nell'anima dell'altro.",
      "Auguri, {name}! Riflettendo sull'unione, capiamo che l'amore vero è l'arte di fondere due esistenze in armonia profonda.",
      "Felice matrimonio, {name}. Nel flusso della vita, il vostro legame è un ponte eterno contro le incertezze dell'essere.",
      "Tantissimi auguri, {name}! La filosofia del matrimonio: è nel condividere il silenzio che si rivela l'essenza dell'amore.",
      "Buon matrimonio, {name}. Ogni 'sì' è una meditazione sull'equilibrio tra libertà e dedizione reciproca.",
      "Auguri, {name}! L'esistenza ci insegna che l'unione autentica è un paradosso: singole anime in un coro cosmico.",
      "Congratulazioni, {name}. Nel grande disegno dell'universo, il vostro amore è un filo necessario per il tappeto del destino.",
      "Tanti auguri, {name}! Il matrimonio invita a interrogarsi: quanto del nostro cammino è eco del desiderio di trascendere soli?",
      "Felice matrimonio, {name}. Ogni promessa è un atto filosofico: celebrare la continuità nel mutamento costante.",
      "Auguri, {name}! Questo giorno è una domanda eterna sull'amore: la vostra risposta è la celebrazione più profonda."
    ],
    "Giovane": [
      "Congratulazioni, {name}! Matrimonio level up: da couple goals a forever squad! ",
      "Auguri, {name}! Wedding vibes lit: swipe right su questa vita insieme, no cap!",
      "Felice matrimonio, {name}! Squad forever: noi contro il mondo, straight fire!",
      "Tantissimi auguri, {name}! Da crush a endgame: il vostro duo slay tutto!",
      "Buon matrimonio, {name}! Chill mode married: cuddle, chaos e zero solo nights!",
      "Auguri, {name}! Wedding alert: playlist d'amore on, party eternal!",
      "Congratulazioni, {name}! Glow up di coppia: da date nights a dynasty building!",
      "Tanti auguri, {name}! Matrimonio remix: memes, moons e mood young forever!",
      "Felice matrimonio, {name}! Flex su quel 'sì': stories epiche per la vita!",
      "Auguri, {name}! Power couple unlocked: yeet the single life, catch the wins!"
    ],
    "Motivazionali": [
      "Congratulazioni, {name}! Il vostro matrimonio è una alleanza potente: insieme, superate ogni ostacolo e costruite imperi d'amore! ",
      "Auguri, {name}! Questo 'sì' è il vostro turbo: accelerate verso un futuro di sogni condivisi e vittorie epiche! ",
      "Felice matrimonio, {name}! Siete una forza unita: usate il vostro legame per ispirare e conquistare il mondo mano nella mano! ",
      "Tantissimi auguri, {name}! L'unione vi rende invincibili: affrontate la vita con resilienza e passione infinita! ",
      "Buon matrimonio, {name}! Ogni voto è carburante: trasformate sfide in opportunità e brillate come stelle! ",
      "Auguri, {name}! Siate il motore l'uno dell'altro: partite ora verso orizzonti di successo e gioia eterna! ",
      "Congratulazioni, {name}! Il vostro amore motiva: siate audaci, creativi e regnate sul vostro destino condiviso! ",
      "Tanti auguri, {name}! Nutrite il vostro patto con azioni coraggiose: il domani è vostro da plasmare! ",
      "Felice matrimonio, {name}! Questa unione è il vostro superpotere: volate alto e realizzate visioni grandiosi! ",
      "Auguri, {name}! Celebrate la forza del 'per sempre': con determinazione, create una legacy di trionfi! "
    ]
  }
}
